first_routes/app/controllers/artworks_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1 LIMIT $2  [["artist_id", 2], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."user_id" = $1 LIMIT $2  [["user_id", "2"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def index
    @artworks = Artwork.where(artist_id: params[:user_id])
    @shared_artworks = User.find(params[:user_id]).shared_artworks