first_routes/app/controllers/comments_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 30]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 1]]
---
  def index
    if params[:user_id]
      render json: User.find(params[:user_id]).comments
    else
      render json: Artwork.find(params[:artwork_id]).comments

INSERT INTO "comments" ("body", "user_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "nice panda greg"], ["user_id", 30], ["artwork_id", 1], ["created_at", "2018-10-15 20:27:02.129657"], ["updated_at", "2018-10-15 20:27:02.129657"]]
---
  def create
    comment = Comment.new(comment_params)
    if comment.save