first_routes/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE (username LIKE 'soonmi')
---
  def index
    if params[:query].nil? || params[:query][:username].blank?
      render json: User.all
    else
      params[:query][:username] = '%' + params[:query][:username] + '%'
      users = User.where('username LIKE ?',params.require(:query).permit(:username)[:username])

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Panda"], ["created_at", "2018-10-15 18:32:25.353298"], ["updated_at", "2018-10-15 18:32:25.353298"]]
---
  def create
    user = User.new(user_params)
    if user.save

UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Panda4"], ["updated_at", "2018-10-15 18:49:42.641524"], ["id", 25]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
---
  def update
    if User.update(params[:id],user_params)
      @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 24]]
SELECT "users".* FROM "users"
---
  def destroy
    @user = User.find(params[:id])
    if @user.delete
      render json: User.all